//###############################################################################################################
// 파일명      : rout_500ms.c
// 회사명      : G-Philos
// 작성날짜  : 2020.12.17
// 작성자      : KYJ-PC
// 수정날짜  : 2021.01.04
// 수정자      : Lee Sang Cheol
// 설명         : 500ms routine
//###############################################################################################################

#include "Define.h"

void rout_500ms()
{
    if(time_check_cnt == 9)   LED1_ON;

    rout_500ms_count++;

    if ((Cnt_T_1000ms--) == 0)
    {
        Flag_T_1000ms = 1;
        Cnt_T_1000ms = Set_T_1000ms - 1;
    }

    if(time_check_cnt == 9)   LED1_OFF;

}
