//###############################################################################################################
// 파일명      : rout_500us.c
// 회사명      : G-Philos
// 작성날짜  : 2020.12.17
// 작성자      : KYJ-PC
// 수정날짜  : 2021.01.04
// 수정자      : Lee Sang Cheol
// 설명         : 500us routine
//###############################################################################################################

#include "Define.h"

Write_Time tt_time;


void rout_500us()
{
    if(time_check_cnt == 4)   LED1_ON;

    rout_500us_count++;

/*--------------------------------------*/
/*  RS232 A port RX                     */
/*--------------------------------------*/
    serial_modbus_500us_a();

/*--------------------------------------*/
/*  RS485 B port RX                     */
/*--------------------------------------*/
    serial_modbus_500us();

#ifdef _BLACKBOX
    Get_Edit_Addr_Info();
#endif

    if(time_check_cnt == 4)   LED1_OFF;
}
