//###############################################################################################################
// 파일명      : rout_250us.c
// 회사명      : G-Philos
// 작성날짜  : 2020.12.17
// 작성자      : KYJ-PC
// 수정날짜  : 2021.01.04
// 수정자      : Lee Sang Cheol
// 설명         : 250us routine
//###############################################################################################################

#include "Define.h"

void rout_250us()
{
#if 1
    if(time_check_cnt == 3)   LED1_ON;
    rout_250us_count++;
    if(time_check_cnt == 3)   LED1_OFF;
#endif
}

